app/controllers/candies_controller.rb

SELECT `candies`.* FROM `candies`
---
  def index
    @candies = Candy.all

INSERT INTO `candies` (`title`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `manufacturer`, `created_at`, `updated_at`) VALUES ('TitleCandy1', 'cvet-ovechki.jpg', 'image/jpeg', 33774, '2016-09-27 22:21:09.494490', 'ManufacturerCandy1', '2016-09-27 22:21:09.800980', '2016-09-27 22:21:09.800980')
---
  def create
    @candy = Candy.new(candy_params)

    respond_to do |format|
      if @candy.save

UPDATE "candies" SET "manufacturer" = ?, "updated_at" = ? WHERE "candies"."id" = ?  [["manufacturer", "Классик"], ["updated_at", "2017-09-17 06:47:38.944424"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @candy.update(candy_params)

SELECT  "candies".* FROM "candies" WHERE "candies"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_candy
      @candy = Candy.find(params[:id])