app/controllers/home_controller.rb

  def index
    @products = Product.where(types: 'titul1')
---
SELECT "products".* FROM "products" WHERE "products"."types" = ?  [["types", "t"]]

  def roshen
    @products = Product.where(types: 'Подарки Рошен')
---
SELECT "products".* FROM "products" WHERE "products"."types" = ?  [["types", "r"]]

  def elit
    @products = Product.where(types: 'Новогодняя упаковка')
---
SELECT `products`.* FROM `products` WHERE `products`.`types` = 'np'

  def prestig
    @products = Product.where(types: 'Подарки Престиж')
---
SELECT "products".* FROM "products" WHERE "products"."types" = ?  [["types", "p"]]

  def vip
    @products = Product.where(types: 'Подарки VIP')
---
SELECT "products".* FROM "products" WHERE "products"."types" = ?  [["types", "v"]]

  def all
    @products = Product.where(types: ['Подарки VIP','Подарки Престиж','Подарки Рошен'])
---
SELECT `products`.* FROM `products` WHERE `products`.`types` IN ('v', 'p', 'r', 'c')