app/views/products/index.html.erb

SELECT "packings".* FROM "packings" INNER JOIN "packings_products" ON "packings"."id" = "packings_products"."packing_id" WHERE "packings_products"."product_id" = ?  [["product_id", 1]]
SELECT "candies".* FROM "candies" INNER JOIN "candies_products" ON "candies"."id" = "candies_products"."candy_id" WHERE "candies_products"."product_id" = ?  [["product_id", 1]]
---
      <tr>
        <td><%= product.packings.map {|c| c.title}.join(', ') %></td>
        <td><%= product.candies.map {|c| c.title}.join(', ') %></td>