app/views/products/show.html.erb

SELECT  1 AS one FROM "candies" INNER JOIN "candies_products" ON "candies"."id" = "candies_products"."candy_id" WHERE "candies_products"."product_id" = ? LIMIT 1  [["product_id", 1]]
SELECT "candies".* FROM "candies" INNER JOIN "candies_products" ON "candies"."id" = "candies_products"."candy_id" WHERE "candies_products"."product_id" = ?  [["product_id", 1]]
---

<% if @product.candies.empty? %>

SELECT  1 AS one FROM "packings" INNER JOIN "packings_products" ON "packings"."id" = "packings_products"."packing_id" WHERE "packings_products"."product_id" = ? LIMIT 1  [["product_id", 1]]
SELECT "packings".* FROM "packings" INNER JOIN "packings_products" ON "packings"."id" = "packings_products"."packing_id" WHERE "packings_products"."product_id" = ?  [["product_id", 1]]
---

<% if @product.packings.empty? %>